driver-tests/bpelse/JavaEEIntegration/BPToJavaEE/JavaEEFault/EjbFaultJBI/test/ThrowFaultTest/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:htt="http://xml.netbeans.org/schema/HttpServiceSchema">
  <soapenv:Body>
    <htt:MsgElem>Hello</htt:MsgElem>
  </soapenv:Body>
</soapenv:Envelope>